mengxyz/PN0031/app/ch32_v006_rewinder/src/main_rewinder.c
/* main_rewinder.c
 *
 * Bus    USART1 RS485 460800 8N1 PD6=TX PD5=RX PD4=DE
 * PN0031 USART2       115200 8N1 PD2=TX PD3=RX  (GPIO_PartialRemap3_USART2)
 * Motors TIM2_CH1(PC0) TIM2_CH3(PC3) TIM1_CH2(PC5) TIM1_CH4(PC7) — SI2318A MOSFET, one-way PWM
 * PCF8574 SW-I2C PC1=SDA PC2=SCL PC4=INT  addr 0x20
 *   P7=SW1  P6=SWI1  P5=SW2  P4=SWI2  P3=SW4  P2=SWI4  P1=SW3  P0=SWI3
 * ARGB    WS2812 x5  PC6   LEDs 0-3 = motors, LED 4 = system
 * LED     PD0
 */

#include <stdbool.h>
#include <stdint.h>
#include <string.h>

#include <ch32v00X.h>
#include "ch32v00X_tim.h"
#include "ch32v00X_dma.h"
#include "ch32v00X_spi.h"
#include "lib/pcf8574_sw_i2c.h"
#include "ch32v00X_flash.h"

/* WS2812B SPI+DMA driver — CH32V006 register name shims */
#define AHBPCENR               HBPCENR
#define APB2PCENR              PB2PCENR
#define RCC_AHBPeriph_DMA1     RCC_HBPeriph_DMA1
#define RCC_APB2Periph_GPIOC   RCC_PB2Periph_GPIOC
#define RCC_APB2Periph_SPI1    RCC_PB2Periph_SPI1
#define GPIO_Speed_10MHz       GPIO_Speed_30MHz
#define GPIO_CNF_OUT_PP_AF     0x08
#define CTLR1_SPE_Set          ((uint16_t)0x0040)
#define WS_LED_COUNT           ARGB_LED_COUNT
#define WS2812DMA_IMPLEMENTATION
#define DMALEDS                8
#define WSGRB
#include "lib/ws2812b_dma_spi_led_driver.h"

/* ------------------------------------------------------------------ */
/* Device identity                                                      */
/* ------------------------------------------------------------------ */
#define DEV_TYPE_HEATER   0x00U
#define DEV_TYPE_REWINDER 0x01U
#define DEVICE_TYPE       DEV_TYPE_REWINDER
#define DEVICE_ADDR       0x01U   /* unique per device, 0x01-0xFE */
#define BROADCAST_ADDR    0xFFU

#define APP_VERSION_MAJOR 0x01U
#define APP_VERSION_MINOR 0x01U
#define APP_VERSION_PATCH 0x03U

#define UID_WORD0         (*(volatile uint32_t *)0x1FFFF7E8U)  /* CH32V006 ESIG_UNIID1 */
#define UID_WORD1         (*(volatile uint32_t *)0x1FFFF7ECU)  /* CH32V006 ESIG_UNIID2 */

/* ------------------------------------------------------------------ */
/* Pin definitions                                                      */
/* ------------------------------------------------------------------ */
#define RS485_DE_PORT    GPIOD
#define RS485_DE_PIN     GPIO_Pin_4

#define LED_PORT         GPIOD
#define LED_PIN          GPIO_Pin_0

#define ARGB_PORT        GPIOC
#define ARGB_PIN         GPIO_Pin_6
#define ARGB_LED_COUNT   5U

#define PCF8574_I2C_PORT GPIOC
#define PCF8574_SDA_PIN  GPIO_Pin_1
#define PCF8574_SCL_PIN  GPIO_Pin_2
#define PCF8574_INT_PORT GPIOC
#define PCF8574_INT_PIN  GPIO_Pin_4
#define PCF8574_ADDR     0x20U

/* SW and SWI bit positions per channel (PCF8574 port, active-low) */
#define SW_BIT_CH(n)  ((n)==1 ? 7 : (n)==2 ? 5 : (n)==3 ? 1 : 3)
#define SWI_BIT_CH(n) ((n)==1 ? 6 : (n)==2 ? 4 : (n)==3 ? 0 : 2)

/* ------------------------------------------------------------------ */
/* Protocol constants                                                   */
/* ------------------------------------------------------------------ */
#define BUS_UART_BAUD    460800U
#define PN0031_UART_BAUD 115200U

#define SOF0  0x55U
#define SOF1  0xAAU

#define CMD_DISCOVER         0x00U
#define CMD_PING             0x01U
#define CMD_ENTER_BOOT       0x22U
#define CMD_GET_VERSION      0x30U
#define CMD_READ_UID         0x32U
#define CMD_READ_FILAMENT    0x33U
#define CMD_MOTOR_CTRL       0x40U
#define CMD_GET_SWITCH_STATUS 0x41U
#define CMD_HB               0x70U   /* heartbeat, master-polled */

#define ST_OK        0x00U
#define ST_BAD_CMD   0x01U
#define ST_BAD_ARG   0x02U
#define ST_IO_ERR    0x04U
#define ST_NO_TAG    0x05U
#define ST_NOT_READY 0x06U

#define BUS_RX_MAX_PAYLOAD 96U

/* PN0031 protocol */
#define PN0031_STX         0xA0U
#define PN0031_ETX         0x0DU
#define PN0031_ADDR        0x00U
#define PN0031_FT_CMD      0x02U
#define PN0031_FC_READ_CARD  0x20U
#define PN0031_FC_READ_BLOCK 0x22U
#define UID_MAX_LEN        16U
#define FRAME_MAX_DATA     96U

/* PWM */
#define PWM_PERIOD  2399U   /* ARR for 10 kHz @ 24 MHz, PSC=0 */
#define MOTOR_START_DUTY 200U
#define MOTOR_RAMP_STEP  40U
#define MOTOR_RAMP_MS    10U
#define PCF_SWITCH_POLL_ENABLE 0U
#define PCF_POLL_MS      20U

/* ------------------------------------------------------------------ */
/* Types                                                                */
/* ------------------------------------------------------------------ */
typedef struct {
    uint8_t antenna;
    uint8_t status;
    uint8_t uid_len;
    uint8_t uid[UID_MAX_LEN];
    uint8_t color_rgba[4];
    int16_t drying_temp_c;
    uint16_t drying_time_h;
    int16_t nozzle_min_c;
    int16_t nozzle_max_c;
    char variant[9];
    char material_id[9];
    char filament_type[17];
    char detailed_type[17];
    char production_time[17];
    bool parsed_ok;
} FilamentDecoded;

/* ------------------------------------------------------------------ */
/* Global state                                                         */
/* ------------------------------------------------------------------ */
static volatile uint32_t g_tick = 0U;
static volatile uint8_t  g_registered = 0U;
static volatile uint32_t g_last_host_tick = 0U;
#define HOST_TIMEOUT_MS  5000U
static Pcf8574Bus        g_pcf_bus = {PCF8574_I2C_PORT, PCF8574_SDA_PIN, PCF8574_SCL_PIN, 20U};
static Pcf8574Device     g_pcf_dev;
static uint8_t           g_motor_speed[4] = {0};   /* speed per channel 1-4 stored at index 0-3 */
static uint16_t          g_motor_ccr[4] = {0};
static uint16_t          g_motor_target_ccr[4] = {0};
static volatile uint32_t g_argb[ARGB_LED_COUNT];    /* packed 0x00RRGGBB, sent as GRB via WSGRB */
static uint32_t          g_last_hb_blink_tick = 0U;
static uint8_t           g_hb_led_on = 0U;
static uint32_t          g_last_motor_ramp_tick = 0U;
static uint32_t          g_last_pcf_poll_tick = 0U;

/* ------------------------------------------------------------------ */
/* Delay / SysTick                                                      */
/* ------------------------------------------------------------------ */
void SysTick_Handler(void) __attribute__((interrupt("WCH-Interrupt-fast")));
void SysTick_Handler(void)
{
    g_tick++;
    SysTick->SR = 0;  /* must clear — if left set, SysTick re-asserts immediately and starves DMA IRQ */
}

static void delay_ms(uint32_t ms)
{
    /* busy-loop — independent of SysTick so it works even when SysTick is disabled during DMA */
    while (ms-- != 0U) {
        for (volatile uint32_t d = 0; d < 12000U; d++) {}  /* ~1ms @ 48MHz, 4 cycles/iter */
    }
}

