mengxyz/PN0031/app/ch32_v006_rewinder/src/main_rewinder.c
/* ------------------------------------------------------------------ */
/* LED (PD0)                                                            */
/* ------------------------------------------------------------------ */
static void led_init(void)
{
    GPIO_InitTypeDef g = {0};
    RCC_PB2PeriphClockCmd(RCC_PB2Periph_GPIOD, ENABLE);
    g.GPIO_Pin   = LED_PIN;
    g.GPIO_Speed = GPIO_Speed_30MHz;
    g.GPIO_Mode  = GPIO_Mode_Out_PP;
    GPIO_Init(LED_PORT, &g);
    GPIO_ResetBits(LED_PORT, LED_PIN);
}

static void led_set(bool on)
{
    if (on) GPIO_SetBits(LED_PORT, LED_PIN);
    else    GPIO_ResetBits(LED_PORT, LED_PIN);
}

/* ------------------------------------------------------------------ */
/* ARGB — WS2812B via SPI+DMA on PC6 (SPI1 MOSI)                      */
/* WS2812BDMAInit() configures PC6 as AF push-pull and starts DMA.     */
/* ------------------------------------------------------------------ */

uint32_t WS2812BLEDCallback(int ledno)
{
    if (ledno < (int)ARGB_LED_COUNT) return g_argb[ledno];
    return 0U;
}

static void argb_flush(void)
{
    uint32_t ctlr = SysTick->CTLR;
    SysTick->CTLR = 0U;
    while (WS2812BLEDInUse) { }
    WS2812BDMAStart(ARGB_LED_COUNT);
    while (WS2812BLEDInUse) { }
    SysTick->CTLR = ctlr;
}

static void argb_set(uint8_t idx, uint8_t r, uint8_t g, uint8_t b)
{
    if (idx >= ARGB_LED_COUNT) return;
    /* WSGRB driver maps bits[23:16]->B, bits[15:8]->G, bits[7:0]->R on wire */
    g_argb[idx] = ((uint32_t)b << 16) | ((uint32_t)g << 8) | r;
}

static void argb_all_off(void)
{
    uint8_t i;
    for (i = 0U; i < ARGB_LED_COUNT; i++) g_argb[i] = 0U;
    argb_flush();
}

static void argb_update_sys(void)
{
    /* WSGRB packing: (b<<16)|(g<<8)|r */
    g_argb[4] = g_registered ? 0x00000C00U   /* green: master online */
                             : 0x0000000CU;  /* red: no master */
}

static void argb_update_motors(void)
{
    uint8_t ch;
    for (ch = 1U; ch <= 4U; ch++) {
        if (g_motor_speed[ch - 1U] > 0U) {
            argb_set(ch - 1U, 0U, 127U, 0U);   /* green 50% = active */
        } else {
            argb_set(ch - 1U, 12U, 12U, 12U);  /* white 5% = idle */
        }
    }
}

static void bus_mark_master_seen(void)
{
    g_last_host_tick = g_tick;
    if (!g_registered) {
        g_registered = 1U;
        g_last_hb_blink_tick = g_tick;
        g_hb_led_on = 1U;
        led_set(true);
        argb_update_sys();
        argb_flush();
    }
}

/* ------------------------------------------------------------------ */
/* PCF8574 & switches                                                   */
/* ------------------------------------------------------------------ */
static bool sw_is_triggered(uint8_t ch_1to4)
{
    uint8_t bit  = (uint8_t)SW_BIT_CH(ch_1to4);
    uint8_t mask = (uint8_t)(1U << bit);
    return (g_pcf_dev.last_state & mask) == 0U; /* active-low */
}

static uint8_t sw_online_mask(void)
{
    uint8_t m = 0U, ch;
    for (ch = 1U; ch <= 4U; ch++) {
        if (sw_is_triggered(ch)) m |= (uint8_t)(1U << (ch - 1U));
    }
    return m;
}

/* ------------------------------------------------------------------ */
/* PWM — TIM2 (CH1 PC0, CH3 PC3, remap4) + TIM1 (CH2 PC5, CH4 PC7, remap7) */
/* ------------------------------------------------------------------ */
static void pwm_init(void)
{
    GPIO_InitTypeDef        gpio = {0};
    TIM_TimeBaseInitTypeDef tb   = {0};
    TIM_OCInitTypeDef       oc   = {0};

    RCC_PB2PeriphClockCmd(RCC_PB2Periph_GPIOC | RCC_PB2Periph_AFIO, ENABLE);
    RCC_PB1PeriphClockCmd(RCC_PB1Periph_TIM2, ENABLE);
    RCC_PB2PeriphClockCmd(RCC_PB2Periph_TIM1, ENABLE);

    GPIO_PinRemapConfig(GPIO_PartialRemap4_TIM2, ENABLE);
    GPIO_PinRemapConfig(GPIO_PartialRemap7_TIM1, ENABLE);

    /* PC0, PC3, PC5, PC7 = AF_PP */
    gpio.GPIO_Speed = GPIO_Speed_30MHz;
    gpio.GPIO_Mode  = GPIO_Mode_AF_PP;
    gpio.GPIO_Pin   = GPIO_Pin_0 | GPIO_Pin_3 | GPIO_Pin_5 | GPIO_Pin_7;
    GPIO_Init(GPIOC, &gpio);

    /* TIM2: CH1 (PC0) and CH3 (PC3) at 10 kHz */
    tb.TIM_Period        = PWM_PERIOD;
    tb.TIM_Prescaler     = 0;
    tb.TIM_ClockDivision = TIM_CKD_DIV1;
    tb.TIM_CounterMode   = TIM_CounterMode_Up;
    TIM_TimeBaseInit(TIM2, &tb);

    oc.TIM_OCMode      = TIM_OCMode_PWM1;
    oc.TIM_OutputState = TIM_OutputState_Enable;
    oc.TIM_Pulse       = 0;
    oc.TIM_OCPolarity  = TIM_OCPolarity_High;
    TIM_OC1Init(TIM2, &oc);
    TIM_OC3Init(TIM2, &oc);
    TIM_OC1PreloadConfig(TIM2, TIM_OCPreload_Enable);
    TIM_OC3PreloadConfig(TIM2, TIM_OCPreload_Enable);
    TIM_ARRPreloadConfig(TIM2, ENABLE);
    TIM_Cmd(TIM2, ENABLE);

    /* TIM1: CH2 (PC5) and CH4 (PC7) at 10 kHz */
    TIM_TimeBaseInit(TIM1, &tb);
    TIM_OC2Init(TIM1, &oc);
    TIM_OC4Init(TIM1, &oc);
    TIM_OC2PreloadConfig(TIM1, TIM_OCPreload_Enable);
    TIM_OC4PreloadConfig(TIM1, TIM_OCPreload_Enable);
    TIM_ARRPreloadConfig(TIM1, ENABLE);
    TIM_CtrlPWMOutputs(TIM1, ENABLE);  /* MOE bit required for TIM1 */
    TIM_Cmd(TIM1, ENABLE);
}

static void motor_apply_ccr(uint8_t ch_1to4, uint16_t ccr)
{
    if (ch_1to4 < 1U || ch_1to4 > 4U) return;
    if (ccr > PWM_PERIOD) ccr = PWM_PERIOD;
    switch (ch_1to4) {
    case 1: TIM2->CH1CVR = ccr; break;
    case 2: TIM2->CH3CVR = ccr; break;
    case 3: TIM1->CH2CVR = ccr; break;
    case 4: TIM1->CH4CVR = ccr; break;
    }
}

static uint16_t motor_speed_to_ccr(uint8_t speed)
{
    uint32_t ccr;
    if (speed == 0U) return 0U;
    ccr = (uint32_t)speed * (PWM_PERIOD + 1U) / 255U;
    if (ccr < MOTOR_START_DUTY) ccr = MOTOR_START_DUTY;
    if (ccr > PWM_PERIOD) ccr = PWM_PERIOD;
    return (uint16_t)ccr;
}

static void motor_set_speed(uint8_t ch_1to4, uint8_t speed)
{
    uint8_t idx;
    uint16_t target;
    if (ch_1to4 < 1U || ch_1to4 > 4U) return;
    idx = (uint8_t)(ch_1to4 - 1U);
    target = motor_speed_to_ccr(speed);
    g_motor_speed[idx] = speed;
    g_motor_target_ccr[idx] = target;
    if (target == 0U) {
        g_motor_ccr[idx] = 0U;
        motor_apply_ccr(ch_1to4, 0U);
    } else if (g_motor_ccr[idx] == 0U) {
        g_motor_ccr[idx] = MOTOR_START_DUTY;
        motor_apply_ccr(ch_1to4, g_motor_ccr[idx]);
    }
    argb_update_motors();
}

static void motor_ramp_task(void)
{
    uint8_t ch;
    if ((g_tick - g_last_motor_ramp_tick) < MOTOR_RAMP_MS) return;
    g_last_motor_ramp_tick = g_tick;

    for (ch = 1U; ch <= 4U; ch++) {
        uint8_t idx = (uint8_t)(ch - 1U);
        uint16_t cur = g_motor_ccr[idx];
        uint16_t target = g_motor_target_ccr[idx];
        if (cur == target) continue;
        if (cur < target) {
            uint16_t next = (uint16_t)(cur + MOTOR_RAMP_STEP);
            cur = (next > target || next < cur) ? target : next;
        } else {
            cur = (uint16_t)((cur - target) > MOTOR_RAMP_STEP ? (cur - MOTOR_RAMP_STEP) : target);
        }
        g_motor_ccr[idx] = cur;
        motor_apply_ccr(ch, cur);
    }
}

/* auto-stop motors when SW switch triggers */
#if PCF_SWITCH_POLL_ENABLE
static void motor_sw_check(void)
{
    uint8_t ch;
    if (!pcf8574_refresh(&g_pcf_bus, &g_pcf_dev)) return;
    for (ch = 1U; ch <= 4U; ch++) {
        uint8_t bit  = (uint8_t)SW_BIT_CH(ch);
        uint8_t mask = (uint8_t)(1U << bit);
        if ((g_pcf_dev.changed_mask & mask) != 0U &&
            (g_pcf_dev.last_state & mask) == 0U) {
            /* SW went low (triggered) → stop motor */
            motor_set_speed(ch, 0U);
        }
    }
}
#endif

static void pcf_switch_task(void)
{
#if PCF_SWITCH_POLL_ENABLE
    if ((g_tick - g_last_pcf_poll_tick) < PCF_POLL_MS) return;
    g_last_pcf_poll_tick = g_tick;
    motor_sw_check();
#endif
}

