mengxyz/PN0031/app/ch32_v006_rewinder/src/main_rewinder.c
/* ------------------------------------------------------------------ */
/* Bus UART — USART1 RS485                                              */
/* ------------------------------------------------------------------ */
static void bus_uart_init(void)
{
    GPIO_InitTypeDef  gpio = {0};
    USART_InitTypeDef uart = {0};

    RCC_PB2PeriphClockCmd(RCC_PB2Periph_GPIOD | RCC_PB2Periph_AFIO | RCC_PB2Periph_USART1, ENABLE);
    GPIO_PinRemapConfig(GPIO_PartialRemap1_USART1, ENABLE);

    gpio.GPIO_Pin   = RS485_DE_PIN;
    gpio.GPIO_Speed = GPIO_Speed_30MHz;
    gpio.GPIO_Mode  = GPIO_Mode_Out_PP;
    GPIO_Init(RS485_DE_PORT, &gpio);
    GPIO_ResetBits(RS485_DE_PORT, RS485_DE_PIN);

    gpio.GPIO_Pin   = GPIO_Pin_6;
    gpio.GPIO_Mode  = GPIO_Mode_AF_PP;
    GPIO_Init(GPIOD, &gpio);

    gpio.GPIO_Pin   = GPIO_Pin_5;
    gpio.GPIO_Mode  = GPIO_Mode_IN_FLOATING;
    GPIO_Init(GPIOD, &gpio);

    USART_StructInit(&uart);
    uart.USART_BaudRate            = BUS_UART_BAUD;
    uart.USART_WordLength          = USART_WordLength_8b;
    uart.USART_StopBits            = USART_StopBits_1;
    uart.USART_Parity              = USART_Parity_No;
    uart.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
    uart.USART_Mode                = USART_Mode_Rx | USART_Mode_Tx;
    USART_Init(USART1, &uart);
    USART_Cmd(USART1, ENABLE);
}

static void bus_uart_write(const uint8_t *buf, uint16_t len)
{
    uint16_t i;
    GPIO_SetBits(RS485_DE_PORT, RS485_DE_PIN);
    for (volatile uint16_t t = 0; t < 200U; t++) {}
    for (i = 0; i < len; i++) {
        while ((USART1->STATR & USART_FLAG_TXE) == 0) {}
        USART1->DATAR = buf[i];
    }
    while ((USART1->STATR & USART_FLAG_TC) == 0) {}
    GPIO_ResetBits(RS485_DE_PORT, RS485_DE_PIN);
}

static bool bus_uart_read_byte(uint8_t *out)
{
    if ((USART1->STATR & USART_FLAG_RXNE) != 0) {
        *out = (uint8_t)(USART1->DATAR & 0xFFU);
        return true;
    }
    return false;
}

/* ------------------------------------------------------------------ */
/* PN0031 UART — USART2                                                 */
/* NOTE: GPIO_PartialRemap3_USART2 maps TX=PD2, RX=PD3.               */
/* Migration doc labels PD2=RX_2, PD3=TX_2 from PN0031 perspective.   */
/* ------------------------------------------------------------------ */
static void pn_uart_init(void)
{
    GPIO_InitTypeDef  gpio = {0};
    USART_InitTypeDef uart = {0};

    RCC_PB2PeriphClockCmd(RCC_PB2Periph_GPIOD | RCC_PB2Periph_AFIO | RCC_PB2Periph_USART2, ENABLE);
    GPIO_PinRemapConfig(GPIO_PartialRemap3_USART2, ENABLE);

    gpio.GPIO_Pin   = GPIO_Pin_2;
    gpio.GPIO_Speed = GPIO_Speed_30MHz;
    gpio.GPIO_Mode  = GPIO_Mode_AF_PP;
    GPIO_Init(GPIOD, &gpio);

    gpio.GPIO_Pin   = GPIO_Pin_3;
    gpio.GPIO_Mode  = GPIO_Mode_IN_FLOATING;
    GPIO_Init(GPIOD, &gpio);

    USART_StructInit(&uart);
    uart.USART_BaudRate            = PN0031_UART_BAUD;
    uart.USART_WordLength          = USART_WordLength_8b;
    uart.USART_StopBits            = USART_StopBits_1;
    uart.USART_Parity              = USART_Parity_No;
    uart.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
    uart.USART_Mode                = USART_Mode_Rx | USART_Mode_Tx;
    USART_Init(USART2, &uart);
    USART_Cmd(USART2, ENABLE);
}

static bool pn_read_byte(uint8_t *out, uint32_t timeout_loops)
{
    while (timeout_loops-- != 0U) {
        if ((USART2->STATR & USART_FLAG_RXNE) != 0) {
            *out = (uint8_t)(USART2->DATAR & 0xFFU);
            return true;
        }
    }
    return false;
}

static void pn_flush_rx(void)
{
    while ((USART2->STATR & USART_FLAG_RXNE) != 0) { (void)USART2->DATAR; }
}

static void pn_write(const uint8_t *buf, uint16_t len)
{
    uint16_t i;
    for (i = 0; i < len; i++) {
        while ((USART2->STATR & USART_FLAG_TXE) == 0) {}
        USART2->DATAR = buf[i];
    }
    while ((USART2->STATR & USART_FLAG_TC) == 0) {}
}

/* ------------------------------------------------------------------ */
/* PN0031 protocol helpers                                              */
/* ------------------------------------------------------------------ */
static uint8_t xor_checksum(const uint8_t *d, uint16_t len)
{
    uint8_t x = 0; uint16_t i;
    for (i = 0; i < len; i++) x ^= d[i];
    return x;
}

static bool pn_send_cmd(uint8_t fc, const uint8_t *data, uint16_t len)
{
    uint8_t frame[8 + FRAME_MAX_DATA];
    if (len > FRAME_MAX_DATA) return false;
    frame[0] = PN0031_STX; frame[1] = PN0031_ADDR;
    frame[2] = PN0031_FT_CMD; frame[3] = fc;
    frame[4] = (uint8_t)(len & 0xFFU); frame[5] = (uint8_t)((len >> 8) & 0xFFU);
    memcpy(&frame[6], data, len);
    frame[6 + len] = xor_checksum(frame, (uint16_t)(6 + len));
    frame[7 + len] = PN0031_ETX;
    pn_write(frame, (uint16_t)(8 + len));
    return true;
}

static bool pn_read_frame(uint8_t expect_fc, uint8_t *data_out, uint16_t *len_out, uint32_t tmo)
{
    uint8_t b, hdr[5], bcc, etx;
    uint16_t i, data_len;
    uint8_t chk[6 + FRAME_MAX_DATA];

    do { if (!pn_read_byte(&b, tmo)) return false; } while (b != PN0031_STX);
    for (i = 0; i < 5U; i++) { if (!pn_read_byte(&hdr[i], tmo)) return false; }
    data_len = (uint16_t)hdr[3] | ((uint16_t)hdr[4] << 8);
    if (data_len > FRAME_MAX_DATA) return false;
    for (i = 0; i < data_len; i++) { if (!pn_read_byte(&data_out[i], tmo)) return false; }
    if (!pn_read_byte(&bcc, tmo) || !pn_read_byte(&etx, tmo)) return false;
    if (etx != PN0031_ETX) return false;
    chk[0] = PN0031_STX; chk[1] = hdr[0]; chk[2] = hdr[1];
    chk[3] = hdr[2]; chk[4] = hdr[3]; chk[5] = hdr[4];
    memcpy(&chk[6], data_out, data_len);
    if (xor_checksum(chk, (uint16_t)(6 + data_len)) != bcc) return false;
    if (hdr[1] != PN0031_FT_CMD || hdr[2] != expect_fc) return false;
    *len_out = data_len;
    return true;
}

static bool pn_read_card(uint8_t ant, uint8_t *status, uint8_t *uid, uint8_t *uid_len)
{
    uint8_t req[1], resp[FRAME_MAX_DATA];
    uint16_t len = 0;
    req[0] = ant;
    pn_flush_rx();
    if (!pn_send_cmd(PN0031_FC_READ_CARD, req, 1)) return false;
    if (!pn_read_frame(PN0031_FC_READ_CARD, resp, &len, 400000U)) return false;
    if (len < 1U) return false;
    *status = resp[0];
    if (*status != 0x00U) return true;
    if (len < 3U) return false;
    *uid_len = resp[2];
    if (*uid_len > UID_MAX_LEN) *uid_len = UID_MAX_LEN;
    if ((uint16_t)(3U + *uid_len) > len) return false;
    memcpy(uid, &resp[3], *uid_len);
    return true;
}

static bool pn_read_block(uint8_t ant, uint8_t block, uint8_t key_type,
                          const uint8_t key6[6], uint8_t out16[16])
{
    uint8_t req[10], resp[FRAME_MAX_DATA];
    uint16_t len = 0;
    req[0] = ant; req[1] = block; req[2] = 0x00U; req[3] = key_type;
    memcpy(&req[4], key6, 6);
    pn_flush_rx();
    if (!pn_send_cmd(PN0031_FC_READ_BLOCK, req, 10)) return false;
    if (!pn_read_frame(PN0031_FC_READ_BLOCK, resp, &len, 400000U)) return false;
    if (len < 1U || resp[0] != 0x00U || len != 19U) return false;
    memcpy(out16, &resp[3], 16U);
    return true;
}

