mengxyz/PN0031/app/ch32_v006_rewinder/src/main_rewinder.c
/* ------------------------------------------------------------------ */
/* SHA-256 / HMAC / HKDF for sector key derivation                     */
/* ------------------------------------------------------------------ */
typedef struct { uint32_t state[8]; uint64_t bitlen; uint8_t data[64]; uint32_t datalen; } sha256_ctx_t;
static const uint32_t k_sha[64] = {
    0x428a2f98U,0x71374491U,0xb5c0fbcfU,0xe9b5dba5U,0x3956c25bU,0x59f111f1U,0x923f82a4U,0xab1c5ed5U,
    0xd807aa98U,0x12835b01U,0x243185beU,0x550c7dc3U,0x72be5d74U,0x80deb1feU,0x9bdc06a7U,0xc19bf174U,
    0xe49b69c1U,0xefbe4786U,0x0fc19dc6U,0x240ca1ccU,0x2de92c6fU,0x4a7484aaU,0x5cb0a9dcU,0x76f988daU,
    0x983e5152U,0xa831c66dU,0xb00327c8U,0xbf597fc7U,0xc6e00bf3U,0xd5a79147U,0x06ca6351U,0x14292967U,
    0x27b70a85U,0x2e1b2138U,0x4d2c6dfcU,0x53380d13U,0x650a7354U,0x766a0abbU,0x81c2c92eU,0x92722c85U,
    0xa2bfe8a1U,0xa81a664bU,0xc24b8b70U,0xc76c51a3U,0xd192e819U,0xd6990624U,0xf40e3585U,0x106aa070U,
    0x19a4c116U,0x1e376c08U,0x2748774cU,0x34b0bcb5U,0x391c0cb3U,0x4ed8aa4aU,0x5b9cca4fU,0x682e6ff3U,
    0x748f82eeU,0x78a5636fU,0x84c87814U,0x8cc70208U,0x90befffaU,0xa4506cebU,0xbef9a3f7U,0xc67178f2U
};
static uint32_t rotr(uint32_t x, uint32_t n) { return (x >> n) | (x << (32U - n)); }
static void sha256_transform(sha256_ctx_t *ctx, const uint8_t data[64]) {
    uint32_t m[64], a,b,c,d,e,f,g,h,t1,t2,i;
    for (i=0;i<16U;i++) m[i]=((uint32_t)data[i*4]<<24)|((uint32_t)data[i*4+1]<<16)|((uint32_t)data[i*4+2]<<8)|data[i*4+3];
    for (i=16U;i<64U;i++) { uint32_t s0=(rotr(m[i-15],7)^rotr(m[i-15],18)^(m[i-15]>>3)); uint32_t s1=(rotr(m[i-2],17)^rotr(m[i-2],19)^(m[i-2]>>10)); m[i]=m[i-16]+s0+m[i-7]+s1; }
    a=ctx->state[0];b=ctx->state[1];c=ctx->state[2];d=ctx->state[3];e=ctx->state[4];f=ctx->state[5];g=ctx->state[6];h=ctx->state[7];
    for (i=0;i<64U;i++) { t1=h+(rotr(e,6)^rotr(e,11)^rotr(e,25))+((e&f)^(~e&g))+k_sha[i]+m[i]; t2=(rotr(a,2)^rotr(a,13)^rotr(a,22))+((a&b)^(a&c)^(b&c)); h=g;g=f;f=e;e=d+t1;d=c;c=b;b=a;a=t1+t2; }
    ctx->state[0]+=a;ctx->state[1]+=b;ctx->state[2]+=c;ctx->state[3]+=d;ctx->state[4]+=e;ctx->state[5]+=f;ctx->state[6]+=g;ctx->state[7]+=h;
}
static void sha256_init(sha256_ctx_t *ctx) {
    ctx->datalen=0;ctx->bitlen=0;
    ctx->state[0]=0x6a09e667U;ctx->state[1]=0xbb67ae85U;ctx->state[2]=0x3c6ef372U;ctx->state[3]=0xa54ff53aU;
    ctx->state[4]=0x510e527fU;ctx->state[5]=0x9b05688cU;ctx->state[6]=0x1f83d9abU;ctx->state[7]=0x5be0cd19U;
}
static void sha256_update(sha256_ctx_t *ctx, const uint8_t *data, uint32_t len) {
    uint32_t i;
    for (i=0;i<len;i++) { ctx->data[ctx->datalen++]=data[i]; if (ctx->datalen==64U) { sha256_transform(ctx,ctx->data); ctx->bitlen+=512U; ctx->datalen=0; } }
}
static void sha256_final(sha256_ctx_t *ctx, uint8_t hash[32]) {
    uint32_t i,dl=ctx->datalen;
    ctx->data[dl++]=0x80U; if (dl>56U) { while(dl<64U) ctx->data[dl++]=0; sha256_transform(ctx,ctx->data); dl=0; }
    while(dl<56U) ctx->data[dl++]=0;
    ctx->bitlen+=(uint64_t)ctx->datalen*8ULL;
    for (i=0;i<8U;i++) ctx->data[63U-i]=(uint8_t)(ctx->bitlen>>(8U*i));
    sha256_transform(ctx,ctx->data);
    for (i=0;i<4U;i++) { hash[i]=(uint8_t)(ctx->state[0]>>(24U-i*8U)); hash[i+4]=(uint8_t)(ctx->state[1]>>(24U-i*8U)); hash[i+8]=(uint8_t)(ctx->state[2]>>(24U-i*8U)); hash[i+12]=(uint8_t)(ctx->state[3]>>(24U-i*8U)); hash[i+16]=(uint8_t)(ctx->state[4]>>(24U-i*8U)); hash[i+20]=(uint8_t)(ctx->state[5]>>(24U-i*8U)); hash[i+24]=(uint8_t)(ctx->state[6]>>(24U-i*8U)); hash[i+28]=(uint8_t)(ctx->state[7]>>(24U-i*8U)); }
}
static void hmac_sha256(const uint8_t *key, uint32_t kl, const uint8_t *msg, uint32_t ml, uint8_t out[32]) {
    uint8_t k0[64],kipad[64],kopad[64],tmp[32]; uint32_t i; sha256_ctx_t c;
    memset(k0,0,64);
    if (kl>64U) { sha256_init(&c); sha256_update(&c,key,kl); sha256_final(&c,tmp); memcpy(k0,tmp,32); } else memcpy(k0,key,kl);
    for (i=0;i<64U;i++) { kipad[i]=(uint8_t)(k0[i]^0x36U); kopad[i]=(uint8_t)(k0[i]^0x5CU); }
    sha256_init(&c); sha256_update(&c,kipad,64); sha256_update(&c,msg,ml); sha256_final(&c,tmp);
    sha256_init(&c); sha256_update(&c,kopad,64); sha256_update(&c,tmp,32); sha256_final(&c,out);
}
static void hkdf_expand(const uint8_t prk[32], const uint8_t *info, uint8_t il, uint8_t *okm, uint16_t ol) {
    uint8_t t[32],msg[64],ctr=1U,prev=0U; uint16_t pos=0U;
    memset(t,0,32);
    while (pos<ol) { uint8_t ml=0; if (prev>0) { memcpy(msg,t,prev); ml=prev; } memcpy(msg+ml,info,il); ml=(uint8_t)(ml+il); msg[ml++]=ctr; hmac_sha256(prk,32,msg,ml,t); prev=32;
        uint16_t cp=(uint16_t)((ol-pos)<32U?(ol-pos):32U); memcpy(okm+pos,t,cp); pos=(uint16_t)(pos+cp); ctr++; }
}
static void derive_sector_keys(const uint8_t *uid, uint8_t ul, uint8_t ka[16][6], uint8_t kb[16][6]) {
    static const uint8_t salt[16]={0x9a,0x75,0x9c,0xf2,0xc4,0xf7,0xca,0xff,0x22,0x2c,0xb9,0x76,0x9b,0x41,0xbc,0x96};
    static const uint8_t ia[7]={'R','F','I','D','-','A',0}; static const uint8_t ib[7]={'R','F','I','D','-','B',0};
    uint8_t prk[32],oa[96],ob[96]; uint8_t i;
    hmac_sha256(salt,16,uid,ul,prk); hkdf_expand(prk,ia,7,oa,96); hkdf_expand(prk,ib,7,ob,96);
    for (i=0;i<16U;i++) { memcpy(ka[i],&oa[i*6U],6); memcpy(kb[i],&ob[i*6U],6); }
}

/* ------------------------------------------------------------------ */
/* Filament decode                                                       */
/* ------------------------------------------------------------------ */
static bool poll_filament(uint8_t ant, FilamentDecoded *f)
{
    uint8_t status=0xFFU, uid[UID_MAX_LEN], uid_len=0;
    uint8_t ka[16][6], kb[16][6], raw[64][16];
    static const uint8_t nb[] = {1,2,4,5,6,12};
    uint8_t i;

    memset(f, 0, sizeof(*f)); f->antenna = ant;
    if (!pn_read_card(ant, &status, uid, &uid_len)) return false;
    f->status = status;
    if (status != 0x00U || uid_len == 0U) return true;
    f->uid_len = uid_len; memcpy(f->uid, uid, uid_len);
    derive_sector_keys(uid, uid_len, ka, kb);
    memset(raw, 0, sizeof(raw));
    for (i=0; i<(uint8_t)sizeof(nb); i++) {
        uint8_t blk=nb[i], sec=(uint8_t)(blk/4U);
        if (!pn_read_block(ant,blk,0,ka[sec],raw[blk]))
            if (!pn_read_block(ant,blk,1,kb[sec],raw[blk])) return false;
        delay_ms(3);
    }
    /* parse */
    {
        int16_t nmin=(int16_t)((uint16_t)raw[6][8]|((uint16_t)raw[6][9]<<8));
        int16_t nmax=(int16_t)((uint16_t)raw[6][10]|((uint16_t)raw[6][11]<<8));
        if (nmin>nmax) { int16_t t=nmin; nmin=nmax; nmax=t; }
        f->nozzle_min_c=nmin; f->nozzle_max_c=nmax;
        f->drying_temp_c=(int16_t)((uint16_t)raw[6][0]|((uint16_t)raw[6][1]<<8));
        f->drying_time_h=(uint16_t)raw[6][2]|((uint16_t)raw[6][3]<<8);
        f->color_rgba[0]=raw[5][0]; f->color_rgba[1]=raw[5][1]; f->color_rgba[2]=raw[5][2]; f->color_rgba[3]=raw[5][3];
        /* ascii strings */
        uint8_t k, out, src;
        #define COPY_ASCII(dst, dsz, src_ptr, n) do { out=0; for(k=0;k<(n)&&out+1<(dsz);k++){src=(src_ptr)[k];if(!src)break;if(src>=32&&src<=126)(dst)[out++]=(char)src;} (dst)[out]=0; } while(0)
        COPY_ASCII(f->variant,      9,  &raw[1][0],  8);
        COPY_ASCII(f->material_id,  9,  &raw[1][8],  8);
        COPY_ASCII(f->filament_type,17, &raw[2][0], 16);
        COPY_ASCII(f->detailed_type,17, &raw[4][0], 16);
        COPY_ASCII(f->production_time,17,&raw[12][0],16);
        #undef COPY_ASCII
        f->parsed_ok = true;
    }
    return true;
}

