mengxyz/PN0031/app/ch32_v006_rewinder/src/main_rewinder.c
/* ------------------------------------------------------------------ */
/* Bus protocol                                                          */
/* Frame: 55 AA DEST CMD SEQ PLEN_L PLEN_H [PAYLOAD] CRC16_L CRC16_H  */
/* Response same structure with DEV_ADDR instead of DEST, CMD|0x80.    */
/* CRC16-CCITT (init 0xFFFF, poly 0x1021) over [DEST..PAYLOAD].        */
/* Heartbeat CMD_HB is master-polled and addressed per device.         */
/* ------------------------------------------------------------------ */
static uint16_t crc16(const uint8_t *data, uint16_t len)
{
    uint16_t crc = 0xFFFFU, i, j;
    for (i = 0; i < len; i++) {
        crc ^= (uint16_t)((uint16_t)data[i] << 8);
        for (j = 0; j < 8U; j++)
            crc = (crc & 0x8000U) ? (uint16_t)((crc << 1) ^ 0x1021U) : (uint16_t)(crc << 1);
    }
    return crc;
}

static void put_u16le(uint8_t *p, uint16_t v) { p[0]=(uint8_t)(v&0xFF); p[1]=(uint8_t)(v>>8); }
static uint16_t get_u16le(const uint8_t *p) { return (uint16_t)p[0]|((uint16_t)p[1]<<8); }

static void bus_send(uint8_t cmd, uint8_t seq, const uint8_t *payload, uint16_t plen)
{
    uint8_t frame[8 + BUS_RX_MAX_PAYLOAD];
    uint16_t crc;
    frame[0] = SOF0; frame[1] = SOF1;
    frame[2] = DEVICE_ADDR;
    frame[3] = (uint8_t)(cmd | 0x80U);
    frame[4] = seq;
    put_u16le(&frame[5], plen);
    if (plen > 0U) memcpy(&frame[7], payload, plen);
    crc = crc16(&frame[2], (uint16_t)(5U + plen));
    put_u16le(&frame[7 + plen], crc);
    bus_uart_write(frame, (uint16_t)(9U + plen));
}

static void bus_handle_cmd(uint8_t dest, uint8_t cmd, uint8_t seq,
                           const uint8_t *payload, uint16_t plen)
{
    uint8_t out[BUS_RX_MAX_PAYLOAD];
    uint16_t out_len = 0U;
    bool enter_boot = false;
    bool is_broadcast = (dest == BROADCAST_ADDR);

    /* stagger broadcast responses to avoid RS485 collision */
    if (is_broadcast) {
        for (volatile uint32_t d = 0; d < (uint32_t)DEVICE_ADDR * 96000UL; d++) {}
    }

    switch (cmd) {
    case CMD_DISCOVER:
    case CMD_PING:
    case CMD_GET_VERSION: {
        bus_mark_master_seen();
        uint32_t uid0 = UID_WORD0, uid1 = UID_WORD1;
        out[0]=ST_OK; out[1]=DEVICE_TYPE; out[2]=DEVICE_ADDR;
        out[3]=APP_VERSION_MAJOR; out[4]=APP_VERSION_MINOR; out[5]=APP_VERSION_PATCH;
        out[6]=(uint8_t)(uid0); out[7]=(uint8_t)(uid0>>8);
        out[8]=(uint8_t)(uid0>>16); out[9]=(uint8_t)(uid0>>24);
        out[10]=(uint8_t)(uid1); out[11]=(uint8_t)(uid1>>8);
        out[12]=(uint8_t)(uid1>>16); out[13]=(uint8_t)(uid1>>24);
        out_len = 14U;
        break;
    }
    case CMD_ENTER_BOOT:
        if (plen != 0U) { out[0]=ST_BAD_ARG; out_len=1U; break; }
        argb_all_off();
        FLASH_Unlock_Fast();
        FLASH_ErasePage_Fast((0x08000000UL + 62UL*1024UL - 4UL) & 0xFFFFFF00UL); /* IAP_CAL_ADDR page = 0x0800F700 */
        FLASH->CTLR |= (uint32_t)0x00008000UL;
        FLASH->CTLR |= (uint32_t)0x00000080UL;
        out[0]=ST_OK; out_len=1U; enter_boot=true; break;

    case CMD_READ_UID: {
        if (plen != 1U || payload[0] < 1U || payload[0] > 4U) { out[0]=ST_BAD_ARG; out_len=1U; break; }
        uint8_t ant=payload[0], status=0xFF, uid[UID_MAX_LEN], uid_len=0;
        if (!pn_read_card(ant,&status,uid,&uid_len)) { out[0]=ST_IO_ERR; out_len=1U; break; }
        if (status!=0||uid_len==0) { out[0]=ST_NO_TAG; out[1]=status; out_len=2U; break; }
        out[0]=ST_OK; out[1]=ant; out[2]=status; out[3]=uid_len;
        memcpy(&out[4],uid,uid_len); out_len=(uint16_t)(4U+uid_len); break;
    }
    case CMD_READ_FILAMENT: {
        if (plen != 1U || payload[0] < 1U || payload[0] > 4U) { out[0]=ST_BAD_ARG; out_len=1U; break; }
        FilamentDecoded f;
        if (!poll_filament(payload[0],&f)) { out[0]=ST_IO_ERR; out_len=1U; break; }
        if (f.status!=0||f.uid_len==0) { out[0]=ST_NO_TAG; out[1]=f.status; out_len=2U; break; }
        if (!f.parsed_ok) { out[0]=ST_IO_ERR; out_len=1U; break; }
        uint8_t p=0;
        memset(out,0,sizeof(out));
        out[p++]=ST_OK; out[p++]=f.antenna; out[p++]=f.status; out[p++]=f.uid_len;
        memcpy(&out[p],f.uid,f.uid_len); p=(uint8_t)(p+f.uid_len);
        memcpy(&out[p],f.color_rgba,4); p=(uint8_t)(p+4);
        out[p++]=(uint8_t)((uint16_t)f.drying_temp_c); out[p++]=(uint8_t)((uint16_t)f.drying_temp_c>>8);
        out[p++]=(uint8_t)(f.drying_time_h); out[p++]=(uint8_t)(f.drying_time_h>>8);
        out[p++]=(uint8_t)((uint16_t)f.nozzle_min_c); out[p++]=(uint8_t)((uint16_t)f.nozzle_min_c>>8);
        out[p++]=(uint8_t)((uint16_t)f.nozzle_max_c); out[p++]=(uint8_t)((uint16_t)f.nozzle_max_c>>8);
        memcpy(&out[p],f.variant,8); p=(uint8_t)(p+8);
        memcpy(&out[p],f.material_id,8); p=(uint8_t)(p+8);
        memcpy(&out[p],f.filament_type,16); p=(uint8_t)(p+16);
        memcpy(&out[p],f.detailed_type,16); p=(uint8_t)(p+16);
        memcpy(&out[p],f.production_time,16); p=(uint8_t)(p+16);
        out_len=p; break;
    }
    case CMD_GET_SWITCH_STATUS:
        if (plen != 0U) { out[0]=ST_BAD_ARG; out_len=1U; break; }
        if (!pcf8574_refresh(&g_pcf_bus, &g_pcf_dev)) { out[0]=ST_NOT_READY; out_len=1U; break; }
        out[0]=ST_OK; out[1]=g_pcf_dev.last_state; out[2]=sw_online_mask(); out_len=3U; break;

    case CMD_MOTOR_CTRL:
        /* payload: [ch(1), speed(1)] — speed 0=stop, 1-255=PWM */
        if (plen != 2U || payload[0]<1U || payload[0]>4U) { out[0]=ST_BAD_ARG; out_len=1U; break; }
        motor_set_speed(payload[0], payload[1]);
        out[0]=ST_OK; out_len=1U; break;

    case CMD_HB:
        bus_mark_master_seen();
        out[0]=ST_OK; out[1]=DEVICE_TYPE; out[2]=DEVICE_ADDR; out_len=3U; break;

    default:
        out[0]=ST_BAD_CMD; out_len=1U; break;
    }

    bus_send(cmd, seq, out, out_len);

    if (enter_boot) {
        while ((USART1->STATR & USART_FLAG_TC) == 0U) {}
        RCC_ClearFlag();
        SystemReset_StartMode(Start_Mode_BOOT);
        NVIC_SystemReset();
        while (1) {}
    }
}

static void bus_housekeeping(void)
{
    if (g_registered && (g_tick - g_last_host_tick) >= HOST_TIMEOUT_MS) {
        g_registered = 0U;
        g_hb_led_on = 0U;
        led_set(false);
        argb_update_sys();
        argb_flush();
    }
}

