mengxyz/PN0031/app/ch32_v006_rewinder/src/main_rewinder.c
static void hb_led_task(void)
{
    if (!g_registered) return;
    if ((g_tick - g_last_hb_blink_tick) >= 1000U) {
        g_last_hb_blink_tick = g_tick;
        g_hb_led_on = (uint8_t)!g_hb_led_on;
        led_set(g_hb_led_on != 0U);
    }
}

static void bus_poll(void)
{
    static uint8_t rx[9 + BUS_RX_MAX_PAYLOAD];
    static uint16_t rx_len = 0U;
    uint8_t b;

    while (bus_uart_read_byte(&b)) {
        if (rx_len >= sizeof(rx)) rx_len = 0U;
        rx[rx_len++] = b;
    }

    while (rx_len >= 2U) {
        uint16_t plen, frame_len, crc_rx, crc_calc;

        if (rx[0] != SOF0 || rx[1] != SOF1) {
            memmove(rx, rx+1, (size_t)(rx_len-1U)); rx_len--; continue;
        }
        if (rx_len < 9U) return;   /* min frame: SOF(2)+DEST+CMD+SEQ+PLEN(2)+CRC(2) */

        plen = get_u16le(&rx[5]);
        if (plen > BUS_RX_MAX_PAYLOAD) {
            memmove(rx, rx+1, (size_t)(rx_len-1U)); rx_len--; continue;
        }
        frame_len = (uint16_t)(9U + plen);
        if (rx_len < frame_len) return;

        crc_rx   = get_u16le(&rx[7 + plen]);
        crc_calc = crc16(&rx[2], (uint16_t)(5U + plen));
        if (crc_calc == crc_rx) {
            uint8_t dest = rx[2], cmd = rx[3], seq = rx[4];
            if (dest == DEVICE_ADDR || (dest == BROADCAST_ADDR && cmd == CMD_DISCOVER)) {
                bus_handle_cmd(dest, cmd, seq, &rx[7], plen);
            }
        }

        if (rx_len > frame_len)
            memmove(rx, rx+frame_len, (size_t)(rx_len-frame_len));
        rx_len = (uint16_t)(rx_len - frame_len);
    }
}

/* ------------------------------------------------------------------ */
/* main                                                                 */
/* ------------------------------------------------------------------ */
int main(void)
{
    uint8_t i;

    NVIC_PriorityGroupConfig(NVIC_PriorityGroup_1);
    SystemCoreClockUpdate();

    SysTick->SR   = 0;
    SysTick->CNT  = 0;
    SysTick->CMP  = (SystemCoreClock / 1000U) - 1U;
    SysTick->CTLR = 0x0FU;
    NVIC_EnableIRQ(SysTicK_IRQn);

    led_init();
    WS2812BDMAInit();

    /* startup blink — busy-loop so WS2812B DMA init can't interfere */
    for (i = 0; i < 6U; i++) {
        led_set((i & 1U) != 0U);
        for (volatile uint32_t d = 0; d < 3600000U; d++) {}
    }
    led_set(false);

    /* init ARGB — motors white idle, system LED reflects registration state */
    for (i = 0; i < ARGB_LED_COUNT - 1U; i++) argb_set(i, 12U, 12U, 12U);
    argb_update_sys();  /* red = unregistered at startup */
    argb_flush();

    bus_uart_init();
    pn_uart_init();
    pwm_init();

    pcf8574_bus_init(&g_pcf_bus);
    pcf8574_device_init(&g_pcf_dev, PCF8574_ADDR);
    (void)pcf8574_write_port(&g_pcf_bus, &g_pcf_dev, 0xFFU); /* all inputs */
    (void)pcf8574_refresh(&g_pcf_bus, &g_pcf_dev);

    g_last_pcf_poll_tick = g_tick;

    while (1) {
        bus_housekeeping();
        bus_poll();
        motor_ramp_task();
        pcf_switch_task();
        hb_led_task();
    }
}
